pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6047.h
sfr_b(LCDM10);                                /* LCD memory 10 */

sfr_b(LCDM11);                                /* LCD memory 11 */

sfr_b(LCDM12);                                /* LCD memory 12 */

sfr_b(LCDM13);                                /* LCD memory 13 */

sfr_b(LCDM14);                                /* LCD memory 14 */

sfr_b(LCDM15);                                /* LCD memory 15 */

sfr_b(LCDM16);                                /* LCD memory 16 */

sfr_b(LCDM17);                                /* LCD memory 17 */

sfr_b(LCDM18);                                /* LCD memory 18 */

sfr_b(LCDM19);                                /* LCD memory 19 */

sfr_b(LCDM20);                                /* LCD memory 20 */

sfr_b(LCDM21);                                /* LCD memory 21 */

sfr_b(LCDM22);                                /* LCD memory 22 */

sfr_b(LCDM23);                                /* LCD memory 23 */

sfr_b(LCDM24);                                /* LCD memory 24 */

sfr_b(LCDM25);                                /* LCD memory 25 */

sfr_b(LCDM26);                                /* LCD memory 26 */

sfr_b(LCDM27);                                /* LCD memory 27 */

sfr_b(LCDM28);                                /* LCD memory 28 */

sfr_b(LCDM29);                                /* LCD memory 29 */

sfr_b(LCDM30);                                /* LCD memory 30 */

sfr_b(LCDM31);                                /* LCD memory 31 */

sfr_b(LCDM32);                                /* LCD memory 32 */

sfr_b(LCDM33_LCDBM1);                         /* LCD memory 33 / LCD blinking memory 1 */

sfr_b(LCDM34_LCDBM2);                         /* LCD memory 34 / LCD blinking memory 2 */

sfr_b(LCDM35_LCDBM3);                         /* LCD memory 35 / LCD blinking memory 3 */

sfr_b(LCDM36_LCDBM4);                         /* LCD memory 36 / LCD blinking memory 4 */

sfr_b(LCDM37_LCDBM5);                         /* LCD memory 37 / LCD blinking memory 5 */

sfr_b(LCDM38_LCDBM6);                         /* LCD memory 38 / LCD blinking memory 6 */

sfr_b(LCDM39_LCDBM7);                         /* LCD memory 39 / LCD blinking memory 7 */

sfr_b(LCDM40_LCDBM8);                         /* LCD memory 40 / LCD blinking memory 8 */

sfr_b(LCDM41_LCDBM9);                         /* LCD memory 41 / LCD blinking memory 9 */

sfr_b(LCDM42_LCDBM10);                        /* LCD memory 42 / LCD blinking memory 10 */

sfr_b(LCDM43_LCDBM11);                        /* LCD memory 43 / LCD blinking memory 11 */

sfr_b(LCDM44_LCDBM12);                        /* LCD memory 44 / LCD blinking memory 11 */

sfr_b(LCDM45_LCDBM13);                        /* LCD memory 45 / LCD blinking memory 13 */

sfr_b(LCDM46_LCDBM14);                        /* LCD memory 46 / LCD blinking memory 14 */

sfr_b(LCDM47_LCDBM15);                        /* LCD memory 47 / LCD blinking memory 15 */

sfr_b(LCDM48_LCDBM16);                        /* LCD memory 48 / LCD blinking memory 16 */

sfr_b(LCDM49_LCDBM17);                        /* LCD memory 49 / LCD blinking memory 17 */

sfr_b(LCDM50_LCDBM18);                        /* LCD memory 50 / LCD blinking memory 18 */

sfr_b(LCDM51_LCDBM19);                        /* LCD memory 51 / LCD blinking memory 19 */

sfr_b(LCDM52_LCDBM20);                        /* LCD memory 52 / LCD blinking memory 20 */


/* LCD_C Register Offsets */
#define OFS_LCDCCTL0                     (0x0000)
#define OFS_LCDCCTL0_L                   OFS_LCDCCTL0
#define OFS_LCDCCTL0_H                   OFS_LCDCCTL0+1
#define OFS_LCDCCTL1                     (0x0002)
#define OFS_LCDCCTL1_L                   OFS_LCDCCTL1
#define OFS_LCDCCTL1_H                   OFS_LCDCCTL1+1
#define OFS_LCDCBLKCTL                   (0x0004)
#define OFS_LCDCBLKCTL_L                 OFS_LCDCBLKCTL
#define OFS_LCDCBLKCTL_H                 OFS_LCDCBLKCTL+1
#define OFS_LCDCMEMCTL                   (0x0006)
#define OFS_LCDCMEMCTL_L                 OFS_LCDCMEMCTL
#define OFS_LCDCMEMCTL_H                 OFS_LCDCMEMCTL+1
#define OFS_LCDCVCTL                     (0x0008)
#define OFS_LCDCVCTL_L                   OFS_LCDCVCTL
#define OFS_LCDCVCTL_H                   OFS_LCDCVCTL+1
#define OFS_LCDCPCTL0                    (0x000A)
#define OFS_LCDCPCTL0_L                  OFS_LCDCPCTL0
#define OFS_LCDCPCTL0_H                  OFS_LCDCPCTL0+1
#define OFS_LCDCPCTL1                    (0x000C)
#define OFS_LCDCPCTL1_L                  OFS_LCDCPCTL1
#define OFS_LCDCPCTL1_H                  OFS_LCDCPCTL1+1
#define OFS_LCDCPCTL2                    (0x000E)
#define OFS_LCDCPCTL2_L                  OFS_LCDCPCTL2
#define OFS_LCDCPCTL2_H                  OFS_LCDCPCTL2+1
#define OFS_LCDCPCTL3                    (0x0010)
#define OFS_LCDCPCTL3_L                  OFS_LCDCPCTL3
#define OFS_LCDCPCTL3_H                  OFS_LCDCPCTL3+1
#define OFS_LCDCCPCTL                    (0x0012)
#define OFS_LCDCCPCTL_L                  OFS_LCDCCPCTL
#define OFS_LCDCCPCTL_H                  OFS_LCDCCPCTL+1
#define OFS_LCDCIV                       (0x001E)
#define OFS_LCDCIV_L                     OFS_LCDCIV
#define OFS_LCDCIV_H                     OFS_LCDCIV+1
#define OFS_LCDM1                        (0x0020)
#define OFS_LCDM2                        (0x0021)
#define OFS_LCDM3                        (0x0022)
#define OFS_LCDM4                        (0x0023)
#define OFS_LCDM5                        (0x0024)
#define OFS_LCDM6                        (0x0025)
#define OFS_LCDM7                        (0x0026)
#define OFS_LCDM8                        (0x0027)
#define OFS_LCDM9                        (0x0028)
#define OFS_LCDM10                       (0x0029)
#define OFS_LCDM11                       (0x002A)
#define OFS_LCDM12                       (0x002B)
#define OFS_LCDM13                       (0x002C)
#define OFS_LCDM14                       (0x002D)
#define OFS_LCDM15                       (0x002E)
#define OFS_LCDM16                       (0x002F)
#define OFS_LCDM17                       (0x0030)
#define OFS_LCDM18                       (0x0031)
#define OFS_LCDM19                       (0x0032)
#define OFS_LCDM20                       (0x0033)
#define OFS_LCDM21                       (0x0034)
#define OFS_LCDM22                       (0x0035)
#define OFS_LCDM23                       (0x0036)
#define OFS_LCDM24                       (0x0037)
#define OFS_LCDM25                       (0x0038)
#define OFS_LCDM26                       (0x0039)
#define OFS_LCDM27                       (0x003A)
#define OFS_LCDM28                       (0x003B)
#define OFS_LCDM29                       (0x003C)
#define OFS_LCDM30                       (0x003D)
#define OFS_LCDM31                       (0x003E)
#define OFS_LCDM32                       (0x003F)
#define OFS_LCDM33_LCDBM1                (0x0040)
#define OFS_LCDM34_LCDBM2                (0x0041)
#define OFS_LCDM35_LCDBM3                (0x0042)
#define OFS_LCDM36_LCDBM4                (0x0043)
#define OFS_LCDM37_LCDBM5                (0x0044)
#define OFS_LCDM38_LCDBM6                (0x0045)
#define OFS_LCDM39_LCDBM7                (0x0046)
#define OFS_LCDM40_LCDBM8                (0x0047)
#define OFS_LCDM41_LCDBM9                (0x0048)
#define OFS_LCDM42_LCDBM10               (0x0049)
#define OFS_LCDM43_LCDBM11               (0x004A)
#define OFS_LCDM44_LCDBM12               (0x004B)
#define OFS_LCDM45_LCDBM13               (0x004C)
#define OFS_LCDM46_LCDBM14               (0x004D)
#define OFS_LCDM47_LCDBM15               (0x004E)
#define OFS_LCDM48_LCDBM16               (0x004F)
#define OFS_LCDM49_LCDBM17               (0x0050)
#define OFS_LCDM50_LCDBM18               (0x0051)
#define OFS_LCDM51_LCDBM19               (0x0052)
#define OFS_LCDM52_LCDBM20               (0x0053)

/* LCD_C Control Bits */

/* LCDCCTL0 Control Bits */
#define LCDON                            (0x0001)        /* LCD on */
#define LCDON_L                          (0x0001)
#define LCDON_0                          (0x0000)        /* LCD_C module off */
#define LCDON_1                          (0x0001)        /* LCD_C module on */
#define LCDON_1_L                        (0x0001)
#define LCDON__OFF                       (0x0000)        /* LCD_C module off */
#define LCDON__ON                        (0x0001)        /* LCD_C module on */
#define LCDON__ON_L                      (0x0001)
#define LCDLP                            (0x0002)        /* LCD low-power waveform */
#define LCDLP_L                          (0x0002)
#define LCDLP_0                          (0x0000)        /* Standard LCD waveforms on segment and common lines selected */
#define LCDLP_1                          (0x0002)        /* Low-power LCD waveforms on segment and common lines selected */
#define LCDLP_1_L                        (0x0002)
#define LCDSON                           (0x0004)        /* LCD segments on */
#define LCDSON_L                         (0x0004)
#define LCDSON_0                         (0x0000)        /* All LCD segments are off */
#define LCDSON_1                         (0x0004)        /* All LCD segments are enabled and on or off according to their 
                                                            corresponding memory location */
#define LCDSON_1_L                       (0x0004)
#define LCDSON__OFF                      (0x0000)        /* All LCD segments are off */
#define LCDSON__ON                       (0x0004)        /* All LCD segments are enabled and on or off according to their 
                                                            corresponding memory location */
#define LCDSON__ON_L                     (0x0004)
#define LCDMX                            (0x0038)        /* LCD mux rate */
#define LCDMX_L                          (0x0038)
#define LCDMX0                           (0x0008)        /* LCD mux rate */
#define LCDMX0_L                         (0x0008)
#define LCDMX1                           (0x0010)        /* LCD mux rate */
#define LCDMX1_L                         (0x0010)
#define LCDMX2                           (0x0020)        /* LCD mux rate */
#define LCDMX2_L                         (0x0020)
#define LCDMX_0                          (0x0000)        /* Static */
#define LCDMX_1                          (0x0008)        /* 2-mux */
#define LCDMX_1_L                        (0x0008)
#define LCDMX_2                          (0x0010)        /* 3-mux */
#define LCDMX_2_L                        (0x0010)
#define LCDMX_3                          (0x0018)        /* 4-mux */
#define LCDMX_3_L                        (0x0018)
#define LCDMX_4                          (0x0020)        /* 5-mux */
#define LCDMX_4_L                        (0x0020)
#define LCDMX_5                          (0x0028)        /* 6-mux */
#define LCDMX_5_L                        (0x0028)
#define LCDMX_6                          (0x0030)        /* 7-mux */
#define LCDMX_6_L                        (0x0030)
#define LCDMX_7                          (0x0038)        /* 8-mux */
#define LCDMX_7_L                        (0x0038)
#define LCDMX__STATIC                    (0x0000)        /* Static */
#define LCDMX__2MUX                      (0x0008)        /* 2-mux */
#define LCDMX__2MUX_L                    (0x0008)
#define LCDMX__3MUX                      (0x0010)        /* 3-mux */
#define LCDMX__3MUX_L                    (0x0010)
#define LCDMX__4MUX                      (0x0018)        /* 4-mux */
#define LCDMX__4MUX_L                    (0x0018)
#define LCDMX__5MUX                      (0x0020)        /* 5-mux */
#define LCDMX__5MUX_L                    (0x0020)
#define LCDMX__6MUX                      (0x0028)        /* 6-mux */
#define LCDMX__6MUX_L                    (0x0028)
#define LCDMX__7MUX                      (0x0030)        /* 7-mux */
#define LCDMX__7MUX_L                    (0x0030)
#define LCDMX__8MUX                      (0x0038)        /* 8-mux */
#define LCDMX__8MUX_L                    (0x0038)
#define LCDSSEL                          (0x0080)        /* Clock source select for LCD and blinking frequency */
#define LCDSSEL_L                        (0x0080)
#define LCDSSEL_0                        (0x0000)        /* ACLK (30 kHz to 40 kHz) */
#define LCDSSEL_1                        (0x0080)        /* VLOCLK */
#define LCDSSEL_1_L                      (0x0080)
#define LCDSSEL__ACLK                    (0x0000)        /* ACLK (30 kHz to 40 kHz) */
#define LCDSSEL__VLOCLK                  (0x0080)        /* VLOCLK */
#define LCDSSEL__VLOCLK_L                (0x0080)
#define LCDPRE                           (0x0700)        /* LCD frequency pre-scaler */
#define LCDPRE_H                         (0x0007)
#define LCDPRE0                          (0x0100)        /* LCD frequency pre-scaler */
#define LCDPRE0_H                        (0x0001)
#define LCDPRE1                          (0x0200)        /* LCD frequency pre-scaler */
#define LCDPRE1_H                        (0x0002)
#define LCDPRE2                          (0x0400)        /* LCD frequency pre-scaler */
#define LCDPRE2_H                        (0x0004)
#define LCDPRE_0                         (0x0000)        /* Divide by 1 */
#define LCDPRE_1                         (0x0100)        /* Divide by 2 */
#define LCDPRE_1_H                       (0x0001)
#define LCDPRE_2                         (0x0200)        /* Divide by 4 */
#define LCDPRE_2_H                       (0x0002)
#define LCDPRE_3                         (0x0300)        /* Divide by 8 */
#define LCDPRE_3_H                       (0x0003)
#define LCDPRE_4                         (0x0400)        /* Divide by 16 */
#define LCDPRE_4_H                       (0x0004)
#define LCDPRE_5                         (0x0500)        /* Divide by 32 */
#define LCDPRE_5_H                       (0x0005)
#define LCDPRE__1                        (0x0000)        /* Divide by 1 */
#define LCDPRE__2                        (0x0100)        /* Divide by 2 */
#define LCDPRE__2_H                      (0x0001)
#define LCDPRE__4                        (0x0200)        /* Divide by 4 */
#define LCDPRE__4_H                      (0x0002)
#define LCDPRE__8                        (0x0300)        /* Divide by 8 */
#define LCDPRE__8_H                      (0x0003)
#define LCDPRE__16                       (0x0400)        /* Divide by 16 */
#define LCDPRE__16_H                     (0x0004)
#define LCDPRE__32                       (0x0500)        /* Divide by 32 */
#define LCDPRE__32_H                     (0x0005)
#define LCDDIV                           (0xf800)        /* LCD frequency divider */
#define LCDDIV_H                         (0x00f8)
#define LCDDIV0                          (0x0800)        /* LCD frequency divider */
#define LCDDIV0_H                        (0x0008)
#define LCDDIV1                          (0x1000)        /* LCD frequency divider */
#define LCDDIV1_H                        (0x0010)
#define LCDDIV2                          (0x2000)        /* LCD frequency divider */
#define LCDDIV2_H                        (0x0020)
#define LCDDIV3                          (0x4000)        /* LCD frequency divider */
#define LCDDIV3_H                        (0x0040)
#define LCDDIV4                          (0x8000)        /* LCD frequency divider */
#define LCDDIV4_H                        (0x0080)
#define LCDDIV_0                         (0x0000)        /* Divide by 1 */
#define LCDDIV_1                         (0x0800)        /* Divide by 2 */
#define LCDDIV_1_H                       (0x0008)
#define LCDDIV_2                         (0x1000)        /* Divide by 3 */
#define LCDDIV_2_H                       (0x0010)
#define LCDDIV_3                         (0x1800)        /* Divide by 4 */
#define LCDDIV_3_H                       (0x0018)
#define LCDDIV_4                         (0x2000)        /* Divide by 5 */
#define LCDDIV_4_H                       (0x0020)
#define LCDDIV_5                         (0x2800)        /* Divide by 6 */
#define LCDDIV_5_H                       (0x0028)
#define LCDDIV_6                         (0x3000)        /* Divide by 7 */
#define LCDDIV_6_H                       (0x0030)
#define LCDDIV_7                         (0x3800)        /* Divide by 8 */
#define LCDDIV_7_H                       (0x0038)
#define LCDDIV_8                         (0x4000)        /* Divide by 9 */
#define LCDDIV_8_H                       (0x0040)
#define LCDDIV_9                         (0x4800)        /* Divide by 10 */
#define LCDDIV_9_H                       (0x0048)
#define LCDDIV_10                        (0x5000)        /* Divide by 11 */
#define LCDDIV_10_H                      (0x0050)
#define LCDDIV_11                        (0x5800)        /* Divide by 12 */
#define LCDDIV_11_H                      (0x0058)
#define LCDDIV_12                        (0x6000)        /* Divide by 13 */
#define LCDDIV_12_H                      (0x0060)
#define LCDDIV_13                        (0x6800)        /* Divide by 14 */
#define LCDDIV_13_H                      (0x0068)
#define LCDDIV_14                        (0x7000)        /* Divide by 15 */
#define LCDDIV_14_H                      (0x0070)
#define LCDDIV_15                        (0x7800)        /* Divide by 16 */
#define LCDDIV_15_H                      (0x0078)
#define LCDDIV_16                        (0x8000)        /* Divide by 17 */
#define LCDDIV_16_H                      (0x0080)
#define LCDDIV_17                        (0x8800)        /* Divide by 18 */
#define LCDDIV_17_H                      (0x0088)
#define LCDDIV_18                        (0x9000)        /* Divide by 19 */
#define LCDDIV_18_H                      (0x0090)
#define LCDDIV_19                        (0x9800)        /* Divide by 20 */
#define LCDDIV_19_H                      (0x0098)
#define LCDDIV_20                        (0xa000)        /* Divide by 21 */
#define LCDDIV_20_H                      (0x00a0)
#define LCDDIV_21                        (0xa800)        /* Divide by 22 */
#define LCDDIV_21_H                      (0x00a8)
#define LCDDIV_22                        (0xb000)        /* Divide by 23 */
#define LCDDIV_22_H                      (0x00b0)
#define LCDDIV_23                        (0xb800)        /* Divide by 24 */
#define LCDDIV_23_H                      (0x00b8)
#define LCDDIV_24                        (0xc000)        /* Divide by 25 */
#define LCDDIV_24_H                      (0x00c0)
#define LCDDIV_25                        (0xc800)        /* Divide by 26 */
#define LCDDIV_25_H                      (0x00c8)
#define LCDDIV_26                        (0xd000)        /* Divide by 27 */
#define LCDDIV_26_H                      (0x00d0)
#define LCDDIV_27                        (0xd800)        /* Divide by 28 */
#define LCDDIV_27_H                      (0x00d8)
#define LCDDIV_28                        (0xe000)        /* Divide by 29 */
#define LCDDIV_28_H                      (0x00e0)
#define LCDDIV_29                        (0xe800)        /* Divide by 30 */
#define LCDDIV_29_H                      (0x00e8)
#define LCDDIV_30                        (0xf000)        /* Divide by 31 */
#define LCDDIV_30_H                      (0x00f0)
#define LCDDIV_31                        (0xf800)        /* Divide by 32 */
#define LCDDIV_31_H                      (0x00f8)
#define LCDDIV__1                        (0x0000)        /* Divide by 1 */
#define LCDDIV__2                        (0x0800)        /* Divide by 2 */
#define LCDDIV__2_H                      (0x0008)
#define LCDDIV__3                        (0x1000)        /* Divide by 3 */
#define LCDDIV__3_H                      (0x0010)
#define LCDDIV__4                        (0x1800)        /* Divide by 4 */
#define LCDDIV__4_H                      (0x0018)
#define LCDDIV__5                        (0x2000)        /* Divide by 5 */
#define LCDDIV__5_H                      (0x0020)
#define LCDDIV__6                        (0x2800)        /* Divide by 6 */
#define LCDDIV__6_H                      (0x0028)
#define LCDDIV__7                        (0x3000)        /* Divide by 7 */
#define LCDDIV__7_H                      (0x0030)
#define LCDDIV__8                        (0x3800)        /* Divide by 8 */
#define LCDDIV__8_H                      (0x0038)
#define LCDDIV__9                        (0x4000)        /* Divide by 9 */
#define LCDDIV__9_H                      (0x0040)
#define LCDDIV__10                       (0x4800)        /* Divide by 10 */
#define LCDDIV__10_H                     (0x0048)
#define LCDDIV__11                       (0x5000)        /* Divide by 11 */
#define LCDDIV__11_H                     (0x0050)
#define LCDDIV__12                       (0x5800)        /* Divide by 12 */
#define LCDDIV__12_H                     (0x0058)
#define LCDDIV__13                       (0x6000)        /* Divide by 13 */
#define LCDDIV__13_H                     (0x0060)
#define LCDDIV__14                       (0x6800)        /* Divide by 14 */
#define LCDDIV__14_H                     (0x0068)
#define LCDDIV__15                       (0x7000)        /* Divide by 15 */
#define LCDDIV__15_H                     (0x0070)
#define LCDDIV__16                       (0x7800)        /* Divide by 16 */
#define LCDDIV__16_H                     (0x0078)
#define LCDDIV__17                       (0x8000)        /* Divide by 17 */
#define LCDDIV__17_H                     (0x0080)
#define LCDDIV__18                       (0x8800)        /* Divide by 18 */
#define LCDDIV__18_H                     (0x0088)
#define LCDDIV__19                       (0x9000)        /* Divide by 19 */
#define LCDDIV__19_H                     (0x0090)
#define LCDDIV__20                       (0x9800)        /* Divide by 20 */
#define LCDDIV__20_H                     (0x0098)
#define LCDDIV__21                       (0xa000)        /* Divide by 21 */
#define LCDDIV__21_H                     (0x00a0)
#define LCDDIV__22                       (0xa800)        /* Divide by 22 */
#define LCDDIV__22_H                     (0x00a8)
#define LCDDIV__23                       (0xb000)        /* Divide by 23 */
#define LCDDIV__23_H                     (0x00b0)
#define LCDDIV__24                       (0xb800)        /* Divide by 24 */
#define LCDDIV__24_H                     (0x00b8)
#define LCDDIV__25                       (0xc000)        /* Divide by 25 */
#define LCDDIV__25_H                     (0x00c0)
#define LCDDIV__26                       (0xc800)        /* Divide by 26 */
#define LCDDIV__26_H                     (0x00c8)
#define LCDDIV__27                       (0xd000)        /* Divide by 27 */
#define LCDDIV__27_H                     (0x00d0)
#define LCDDIV__28                       (0xd800)        /* Divide by 28 */
#define LCDDIV__28_H                     (0x00d8)
#define LCDDIV__29                       (0xe000)        /* Divide by 29 */
#define LCDDIV__29_H                     (0x00e0)
#define LCDDIV__30                       (0xe800)        /* Divide by 30 */
#define LCDDIV__30_H                     (0x00e8)
#define LCDDIV__31                       (0xf000)        /* Divide by 31 */
#define LCDDIV__31_H                     (0x00f0)
#define LCDDIV__32                       (0xf800)        /* Divide by 32 */
#define LCDDIV__32_H                     (0x00f8)

