pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6047.h
/* SAPHCH1TT Control Bits */
#define CH1TT                            (0x000f)        /* */
#define CH1TT_L                          (0x000f)
#define CH1TT0                           (0x0001)        /* */
#define CH1TT0_L                         (0x0001)
#define CH1TT1                           (0x0002)        /* */
#define CH1TT1_L                         (0x0002)
#define CH1TT2                           (0x0004)        /* */
#define CH1TT2_L                         (0x0004)
#define CH1TT3                           (0x0008)        /* */
#define CH1TT3_L                         (0x0008)

/* SAPHMCNF Control Bits */
#define LPBE                             (0x0800)        /* */
#define LPBE_H                           (0x0008)
#define LPBE_0                           (0x0000)        /* For manual bias mode and regular ASQ bias mode. In this 
                                                            configuration the user controls by the ASQBSW has full control
                                                            over the TxBias and RxBias switches. */
#define LPBE_1                           (0x0800)        /* Low power bias mode. In this mode the ASQ uses the CHxEBSW and
                                                            PGABSW as auxiliary values to achieve faster channel setting 
                                                            on reactive input loads. The ASQ has full controls over the 
                                                            bias switch multiplexer. */
#define LPBE_1_H                         (0x0008)
#define RSV1                             (0x0600)        /* */
#define RSV1_H                           (0x0006)
#define RSV10                            (0x0200)        /* */
#define RSV10_H                          (0x0002)
#define RSV11                            (0x0400)        /* */
#define RSV11_H                          (0x0004)
#define CPEO                             (0x0100)        /* */
#define CPEO_H                           (0x0001)
#define CPEO_0                           (0x0000)        /* Charge pump is turned on by SDHS and ASQ related requests 
                                                            only. */
#define CPEO_1                           (0x0100)        /* Charge pump is turned on regardless of SDHS and ASQ related 
                                                            charge pump requests. */
#define CPEO_1_H                         (0x0001)
#define RSV0                             (0x000c)        /* */
#define RSV0_L                           (0x000c)
#define RSV00                            (0x0004)        /* */
#define RSV00_L                          (0x0004)
#define RSV01                            (0x0008)        /* */
#define RSV01_L                          (0x0008)
#define BIMP                             (0x0003)        /* */
#define BIMP_L                           (0x0003)
#define BIMP0                            (0x0001)        /* */
#define BIMP0_L                          (0x0001)
#define BIMP1                            (0x0002)        /* */
#define BIMP1_L                          (0x0002)
#define BIMP_0                           (0x0000)        /* 200 Ohms buffer impedance for RxBias and TxBias */
#define BIMP_1                           (0x0001)        /* 600 Ohms buffer impedance for RxBias and TxBias */
#define BIMP_1_L                         (0x0001)
#define BIMP_2                           (0x0002)        /* 1200 Ohms buffer impedance for RxBias and TxBias (default) */
#define BIMP_2_L                         (0x0002)
#define BIMP_3                           (0x0003)        /* 2800 Ohms buffer impedance for RxBias and TxBias */
#define BIMP_3_L                         (0x0003)

/* SAPHTACTL Control Bits */
#define UNLOCK                           (0x0001)        /* */
#define UNLOCK_L                         (0x0001)

/* SAPHICTL0 Control Bits */
#define MUXSEL                           (0x000f)        /* */
#define MUXSEL_L                         (0x000f)
#define MUXSEL0                          (0x0001)        /* */
#define MUXSEL0_L                        (0x0001)
#define MUXSEL1                          (0x0002)        /* */
#define MUXSEL1_L                        (0x0002)
#define MUXSEL2                          (0x0004)        /* */
#define MUXSEL2_L                        (0x0004)
#define MUXSEL3                          (0x0008)        /* */
#define MUXSEL3_L                        (0x0008)
#define MUXSEL_0                         (0x0000)        /* Channel 0 is selected for input */
#define MUXSEL_1                         (0x0001)        /* Channel 1 is selected for input */
#define MUXSEL_1_L                       (0x0001)
#define MUXSEL_2                         (0x0002)        /* reserved for future channels */
#define MUXSEL_2_L                       (0x0002)
#define MUXSEL_3                         (0x0003)        /* reserved for future channels */
#define MUXSEL_3_L                       (0x0003)
#define MUXSEL_4                         (0x0004)        /* reserved for future channels */
#define MUXSEL_4_L                       (0x0004)
#define MUXSEL_5                         (0x0005)        /* reserved for future channels */
#define MUXSEL_5_L                       (0x0005)
#define MUXSEL_6                         (0x0006)        /* reserved for future channels */
#define MUXSEL_6_L                       (0x0006)
#define MUXSEL_7                         (0x0007)        /* reserved for future channels */
#define MUXSEL_7_L                       (0x0007)
#define MUXSEL_8                         (0x0008)        /* no channel is selected */
#define MUXSEL_8_L                       (0x0008)
#define MUXSEL_9                         (0x0009)        /* no channel is selected */
#define MUXSEL_9_L                       (0x0009)
#define MUXSEL_10                        (0x000a)        /* no channel is selected */
#define MUXSEL_10_L                      (0x000a)
#define MUXSEL_11                        (0x000b)        /* no channel is selected */
#define MUXSEL_11_L                      (0x000b)
#define MUXSEL_12                        (0x000c)        /* no channel is selected */
#define MUXSEL_12_L                      (0x000c)
#define MUXSEL_13                        (0x000d)        /* no channel is selected */
#define MUXSEL_13_L                      (0x000d)
#define MUXSEL_14                        (0x000e)        /* no channel is selected */
#define MUXSEL_14_L                      (0x000e)
#define MUXSEL_15                        (0x000f)        /* no channel is selected */
#define MUXSEL_15_L                      (0x000f)
#define MUXSEL__CH0IN                    (0x0000)        /* Channel 0 is selected for input */
#define MUXSEL__CH1IN                    (0x0001)        /* Channel 1 is selected for input */
#define MUXSEL__CH1IN_L                  (0x0001)
#define DUMEN                            (0x0080)        /* */
#define DUMEN_L                          (0x0080)
#define DUMEN_0                          (0x0000)        /* PGA dummy input load is Hi-Z. */
#define DUMEN_1                          (0x0080)        /* PGA dummy input load matches the PGA input impedance. */
#define DUMEN_1_L                        (0x0080)
#define MUXCTL                           (0x0010)        /* */
#define MUXCTL_L                         (0x0010)
#define MUXCTL_0                         (0x0000)        /* The input multiplexer is controlled by ICTL0.MUXSEL (register 
                                                            mode) */
#define MUXCTL_1                         (0x0010)        /* The input multiplexer is controlled by ASQ (auto mode) */
#define MUXCTL_1_L                       (0x0010)

/* SAPHBCTL Control Bits */
#define ASQBSC                           (0x0001)        /* */
#define ASQBSC_L                         (0x0001)
#define ASQBSC_0                         (0x0000)        /* Bias switches are controlled by BCTL.CH0EBSW, BCTL.CH1EBSW, 
                                                            BCTL.PGABSW bits (register mode). */
#define ASQBSC_1                         (0x0001)        /* Bias switches are controlled by ASQ (auto mode) */
#define ASQBSC_1_L                       (0x0001)
#define PGABSW                           (0x0002)        /* */
#define PGABSW_L                         (0x0002)
#define PGABSW_0                         (0x0000)        /* Rx bias switch is open. */
#define PGABSW_1                         (0x0002)        /* Rx bias switch is closed (enabled). */
#define PGABSW_1_L                       (0x0002)
#define EXCBIAS                          (0x0030)        /* */
#define EXCBIAS_L                        (0x0030)
#define EXCBIAS0                         (0x0010)        /* */
#define EXCBIAS0_L                       (0x0010)
#define EXCBIAS1                         (0x0020)        /* */
#define EXCBIAS1_L                       (0x0020)
#define EXCBIAS_0                        (0x0000)        /* 0.2V nominal */
#define EXCBIAS_1                        (0x0010)        /* 0.3V nominal */
#define EXCBIAS_1_L                      (0x0010)
#define EXCBIAS_2                        (0x0020)        /* 0.4V nominal */
#define EXCBIAS_2_L                      (0x0020)
#define EXCBIAS_3                        (0x0030)        /* 0.6V nominal */
#define EXCBIAS_3_L                      (0x0030)
#define PGABIAS                          (0x00c0)        /* */
#define PGABIAS_L                        (0x00c0)
#define PGABIAS0                         (0x0040)        /* */
#define PGABIAS0_L                       (0x0040)
#define PGABIAS1                         (0x0080)        /* */
#define PGABIAS1_L                       (0x0080)
#define PGABIAS_0                        (0x0000)        /* 0.75V nominal */
#define PGABIAS_1                        (0x0040)        /* 0.8V nominal */
#define PGABIAS_1_L                      (0x0040)
#define PGABIAS_2                        (0x0080)        /* 0.9V nominal */
#define PGABIAS_2_L                      (0x0080)
#define PGABIAS_3                        (0x00c0)        /* 0.95V nominal */
#define PGABIAS_3_L                      (0x00c0)
#define CH0EBSW                          (0x0100)        /* */
#define CH0EBSW_H                        (0x0001)
#define CH0EBSW_0                        (0x0000)        /* Tx bias switch to CH0 is open. */
#define CH0EBSW_1                        (0x0100)        /* Tx bias switch to CH0 is closed (enabled). */
#define CH0EBSW_1_H                      (0x0001)
#define CH1EBSW                          (0x0200)        /* */
#define CH1EBSW_H                        (0x0002)
#define CH1EBSW_0                        (0x0000)        /* Tx bias switch to CH1 is open. */
#define CH1EBSW_1                        (0x0200)        /* Tx bias switch to CH1 is closed (enabled). */
#define CH1EBSW_1_H                      (0x0002)
#define CPDA                             (0x0008)        /* */
#define CPDA_L                           (0x0008)
#define CPDA_0                           (0x0000)        /* Turn off the charge pump during data acquisition. */
#define CPDA_1                           (0x0008)        /* Keep charge pump enabled during data acquisition. */
#define CPDA_1_L                         (0x0008)
#define LILC                             (0x0004)        /* */
#define LILC_L                           (0x0004)
#define LILC_0                           (0x0000)        /* LICL is disabled. */
#define LILC_1                           (0x0004)        /* LICL is enabled. */
#define LILC_1_L                         (0x0004)

